Revit 2027 API
ParameterTypeId.FloorStructureIdParam Property
 "Structure"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FloorStructureIdParam { get; }
Public Shared ReadOnly Property FloorStructureIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FloorStructureIdParam {
	ForgeTypeId^ get ();
}
static member FloorStructureIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace